artillery_tests/result_cluster_50x20.txt
Phase started: unnamed (index: 0, duration: 1s) 13:00:03(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 13:00:04(-0300)

--------------------------------------
Metrics for period to: 13:00:10(-0300) (width: 4.201s)
--------------------------------------

errors.ECONNRESET: ............................................................. 22
http.codes.200: ................................................................ 812
http.request_rate: ............................................................. 203/sec
http.requests: ................................................................. 834
http.response_time:
  min: ......................................................................... 59
  max: ......................................................................... 1881
  median: ...................................................................... 108.9
  p95: ......................................................................... 539.2
  p99: ......................................................................... 1353.1
http.responses: ................................................................ 812
vusers.completed: .............................................................. 28
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 22
vusers.session_length:
  min: ......................................................................... 2442.9
  max: ......................................................................... 3655.2
  median: ...................................................................... 3072.4
  p95: ......................................................................... 3534.1
  p99: ......................................................................... 3605.5


All VUs finished. Total time: 6 seconds

--------------------------------
Summary report @ 13:00:10(-0300)
--------------------------------

errors.ECONNRESET: ............................................................. 22
http.codes.200: ................................................................ 812
http.request_rate: ............................................................. 203/sec
http.requests: ................................................................. 834
http.response_time:
  min: ......................................................................... 59
  max: ......................................................................... 1881
  median: ...................................................................... 108.9
  p95: ......................................................................... 539.2
  p99: ......................................................................... 1353.1
http.responses: ................................................................ 812
vusers.completed: .............................................................. 28
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 22
vusers.session_length:
  min: ......................................................................... 2442.9
  max: ......................................................................... 3655.2
  median: ...................................................................... 3072.4
  p95: ......................................................................... 3534.1
  p99: ......................................................................... 3605.5