artillery_tests/result_fork_50x20.txt
Phase started: unnamed (index: 0, duration: 1s) 12:57:43(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 12:57:44(-0300)

--------------------------------------
Metrics for period to: 12:57:50(-0300) (width: 5.599s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 181/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 60
  max: ......................................................................... 3352
  median: ...................................................................... 108.9
  p95: ......................................................................... 257.3
  p99: ......................................................................... 3134.5
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4522.3
  max: ......................................................................... 5559.3
  median: ...................................................................... 4965.3
  p95: ......................................................................... 5487.5
  p99: ......................................................................... 5487.5


All VUs finished. Total time: 7 seconds

--------------------------------
Summary report @ 12:57:51(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 181/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 60
  max: ......................................................................... 3352
  median: ...................................................................... 108.9
  p95: ......................................................................... 257.3
  p99: ......................................................................... 3134.5
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4522.3
  max: ......................................................................... 5559.3
  median: ...................................................................... 4965.3
  p95: ......................................................................... 5487.5
  p99: ......................................................................... 5487.5